<script setup lang="ts">
import AdminHeader from "@/components/ui/AdminHeader.vue";
import Button from "@/components/ui/Button.vue";
import Input from "@/components/ui/Input.vue";

const testResults = [
  {
    fullName: "Мешков Юрий Вечеславович",
    status: "Клиент",
    date: "12.12.2022",
    test: "Экспресс-тестирование",
    result: "постоянный стресс и усталость из-за нехватки времени на работу, детей и самого себя. Клиент часто жалеет себя и к нему поступают плохие мысли."
  },
  {
    fullName: "Мешков Юрий Вечеславович",
    status: "Клиент",
    date: "12.12.2022",
    test: "Экспресс-тестирование",
    result: "постоянный стресс и усталость из-за нехватки времени на работу, детей и самого себя. Клиент часто жалеет себя и к нему поступают плохие мысли."
  },
  {
    fullName: "Мешков Юрий Вечеславович",
    status: "Клиент",
    date: "12.12.2022",
    test: "Экспресс-тестирование",
    result: "постоянный стресс и усталость из-за нехватки времени на работу, детей и самого себя. Клиент часто жалеет себя и к нему поступают плохие мысли."
  },
  {
    fullName: "Мешков Юрий Вечеславович",
    status: "Клиент",
    date: "12.12.2022",
    test: "Экспресс-тестирование",
    result: "постоянный стресс и усталость из-за нехватки времени на работу, детей и самого себя. Клиент часто жалеет себя и к нему поступают плохие мысли."
  },
  {
    fullName: "Мешков Юрий Вечеславович",
    status: "Клиент",
    date: "12.12.2022",
    test: "Экспресс-тестирование",
    result: "постоянный стресс и усталость из-за нехватки времени на работу, детей и самого себя. Клиент часто жалеет себя и к нему поступают плохие мысли."
  }
];

const requests = [
  {
    fullName: "Мешков Юрий Вечеславович",
    post: "Психолог",
    experience: "12 лет педагогической практики в системе дополнительного образования\n" +
      "5 лет опыта индивидуального консультирования родителей и детей\n" +
      "Ведение авторских программ по развитию эмоционального интеллекта у детей младшего школьного возраста",
    education: "Московский педагогический государственный университет\n" +
      "Специальность: Педагогика и психология\n" +
      "Квалификация: Педагог-психолог",
    competencies: "Индивидуальный подход в работе с детьми и родителями, проведение онлайн и оффлайн консультаций, разработка методических материалов и обучающих программ, навыки работы на онлайн-платформах, знание Zoom, Teams",
    reasons: "Почему я хочу работать на платформе \"Оранжевый помощник\":  Я разделяю ценности проекта и считаю, что современным семьям особенно важно иметь доступ к профессиональной помощи и поддержке. Онлайн-формат делает такую помощь доступной и своевременной, а работа в команде единомышленников вдохновляет на развитие и вклад в общее дело.\n" +
      "Готова приступить к работе: с мая 2025 года.",
    phone: "+7 (999) 999-99-99",
    email: "LwTqK@example.com"
  },

  {
    fullName: "Мешков Юрий Вечеславович",
    post: "Психолог",
    experience: "12 лет педагогической практики в системе дополнительного образования\n" +
      "5 лет опыта индивидуального консультирования родителей и детей\n" +
      "Ведение авторских программ по развитию эмоционального интеллекта у детей младшего школьного возраста",
    education: "Московский педагогический государственный университет\n" +
      "Специальность: Педагогика и психология\n" +
      "Квалификация: Педагог-психолог",
    competencies: "Индивидуальный подход в работе с детьми и родителями, проведение онлайн и оффлайн консультаций, разработка методических материалов и обучающих программ, навыки работы на онлайн-платформах, знание Zoom, Teams",
    reasons: "Почему я хочу работать на платформе \"Оранжевый помощник\":  Я разделяю ценности проекта и считаю, что современным семьям особенно важно иметь доступ к профессиональной помощи и поддержке. Онлайн-формат делает такую помощь доступной и своевременной, а работа в команде единомышленников вдохновляет на развитие и вклад в общее дело.\n" +
      "Готова приступить к работе: с мая 2025 года.",
    phone: "+7 (999) 999-99-99",
    email: "LwTqK@example.com"
  },

  {
    fullName: "Мешков Юрий Вечеславович",
    post: "Психолог",
    experience: "12 лет педагогической практики в системе дополнительного образования\n" +
      "5 лет опыта индивидуального консультирования родителей и детей\n" +
      "Ведение авторских программ по развитию эмоционального интеллекта у детей младшего школьного возраста",
    education: "Московский педагогический государственный университет\n" +
      "Специальность: Педагогика и психология\n" +
      "Квалификация: Педагог-психолог",
    competencies: "Индивидуальный подход в работе с детьми и родителями, проведение онлайн и оффлайн консультаций, разработка методических материалов и обучающих программ, навыки работы на онлайн-платформах, знание Zoom, Teams",
    reasons: "Почему я хочу работать на платформе \"Оранжевый помощник\":  Я разделяю ценности проекта и считаю, что современным семьям особенно важно иметь доступ к профессиональной помощи и поддержке. Онлайн-формат делает такую помощь доступной и своевременной, а работа в команде единомышленников вдохновляет на развитие и вклад в общее дело.\n" +
      "Готова приступить к работе: с мая 2025 года.",
    phone: "+7 (999) 999-99-99",
    email: "LwTqK@example.com"
  },

  {
    fullName: "Мешков Юрий Вечеславович",
    post: "Психолог",
    experience: "12 лет педагогической практики в системе дополнительного образования\n" +
      "5 лет опыта индивидуального консультирования родителей и детей\n" +
      "Ведение авторских программ по развитию эмоционального интеллекта у детей младшего школьного возраста",
    education: "Московский педагогический государственный университет\n" +
      "Специальность: Педагогика и психология\n" +
      "Квалификация: Педагог-психолог",
    competencies: "Индивидуальный подход в работе с детьми и родителями, проведение онлайн и оффлайн консультаций, разработка методических материалов и обучающих программ, навыки работы на онлайн-платформах, знание Zoom, Teams",
    reasons: "Почему я хочу работать на платформе \"Оранжевый помощник\":  Я разделяю ценности проекта и считаю, что современным семьям особенно важно иметь доступ к профессиональной помощи и поддержке. Онлайн-формат делает такую помощь доступной и своевременной, а работа в команде единомышленников вдохновляет на развитие и вклад в общее дело.\n" +
      "Готова приступить к работе: с мая 2025 года.",
    phone: "+7 (999) 999-99-99",
    email: "LwTqK@example.com"
  }

];
</script>

<template>
  <AdminHeader />
  <div class="requestsPage flex flex-col gap-11 px-[55px] mt-[70px]">
    <section class="bg-orange-100 p-[20px] max-h-[80vh] overflow-y-auto">
      <div class="flex flex-col gap-6 text-4xl leading-[100%]">
        <h1>
          Результаты тестирования
        </h1>
        <div class="grid grid-cols-3 gap-6">
          <template
            v-for="(testResult, key) in testResults"
            :key=key
          >
            <div class="flex flex-col gap-12 text-2xl leading-[100%] border-[1px] border-black rounded-[10px] p-[20px]">
              <div class="flex flex-col gap-7 ">
                <div class="flex justify-between">
                  <div class="flex flex-col gap-2">
                    <label class="font-semibold">
                      {{ testResult.fullName }}
                    </label>
                    <label>
                      {{ testResult.status }}
                    </label>
                  </div>
                  <div class="flex flex-col gap-2">
                    <label>
                      {{ testResult.date }}
                    </label>
                    <label>
                      {{ testResult.test }}
                    </label>
                  </div>
                </div>
                <div>
                  <p>
                    Результат: {{ testResult.result }}
                  </p>
                </div>
              </div>
              <Button
                color="orange"
                label="Связаться"
                size="medium"
              />
            </div>
          </template>
        </div>
      </div>
    </section>
    <section class="flex flex-col gap-6 text-4xl leading-[100%] p-[20px]">
      <h1>
        Заявки по трудоустройству
      </h1>
      <template
        v-for="(request, index) in requests"
        :key="index"
      >
        <div class="flex flex-col gap-6 border-b-2 border-black pb-6">
          <div class="flex flex-col gap-4 text-xl">
            <div class="flex flex-col gap-2">
              <label>
                ФИО
              </label>
              <Input
                v-model="request.fullName"
                :readonly="true"
              />
            </div>
            <div class="flex flex-col gap-3">
              <label>
                Желаемая должность
              </label>
              <Input
                v-model="request.post"
                :readonly="true"
              />
            </div>
            <div class="flex flex-col gap-3">
              <label>
                Опыт работы
              </label>
              <Input
                v-model="request.experience"
                :readonly="true"
              />
            </div>
            <div class="flex flex-col gap-3">
              <label>
                Образование
              </label>
              <Input
                v-model="request.education"
                :readonly="true"
              />
            </div>
            <div class="flex flex-col gap-3">
              <label>
                Компетенции
              </label>
              <Input
                v-model="request.competencies"
                :readonly="true"
              />
            </div>
            <div class="flex flex-col gap-3">
              <label>
                Причин желания работать именно у нас
              </label>
              <Input
                v-model="request.reasons"
                :readonly="true"
              />
            </div>
            <div class="flex flex-col gap-3">
              <label>
                Телефон
              </label>
              <Input
                v-model="request.phone"
                :readonly="true"
              />
            </div>
            <div class="flex flex-col gap-3">
              <label>
                E-mail
              </label>
              <Input
                v-model="request.email"
                :readonly="true"
              />
            </div>
          </div>
          <div class="flex flex-col gap-3">
            <Button
              label="Принять заявку"
              color="orange"
              size="medium"
            />
            <Button
              label="Отклонить"
              color="black"
              size="medium"
            />
          </div>
        </div>
      </template>
    </section>
  </div>
</template>


<style scoped>

</style>
